       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVAGG.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 MONTHLY-TOTAL     PIC 9(10)V99 VALUE 0.
       01 YEARLY-TOTAL      PIC 9(10)V99 VALUE 0.

       01 MONTHLY-IN        PIC 9(10)V99.
       01 YEARLY-IN         PIC 9(10)V99.

       PROCEDURE DIVISION.

           ACCEPT MONTHLY-IN.
           ACCEPT YEARLY-IN.

           ADD MONTHLY-IN TO MONTHLY-TOTAL.
           ADD YEARLY-IN TO YEARLY-TOTAL.

           DISPLAY MONTHLY-TOTAL.
           DISPLAY YEARLY-TOTAL.

           STOP RUN.
